#### CurveLoop Members

---

|  |
| --- |
| CurveLoop Class   Constructors   Methods   Properties   See Also |

The  CurveLoop  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | CurveLoop | Constructs a new empty curve loop. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Append | Append the curve to this loop. |
| Public method Static member | Create | Creates a new curve loop. |
| Public method Static member | CreateViaCopy | Creates a new curve loop as a copy of the input. |
| Public method Static member | CreateViaOffset(CurveLoop, IList Double , XYZ) | Creates a new curve loop that is an offset of the existing curve loop. |
| Public method Static member | CreateViaOffset(CurveLoop, Double, XYZ) | Creates a new curve loop that is an offset of the existing curve loop. |
| Public method Static member | CreateViaThicken(Curve, Double, XYZ) | Creates a new closed curve loop by thickening the input curve with respect to a given plane. |
| Public method Static member | CreateViaThicken(CurveLoop, Double, XYZ) | Creates a new closed curve loop by thickening the input open curve loop with respect to a given plane. |
| Public method Static member | CreateViaTransform | Creates a new curve loop as a transformed copy of the input curve loop. |
| Public method | Dispose | Releases all resources used by the  CurveLoop |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | Flip | Reverses the orientation of the curve loop. |
| Protected method | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| Public method | GetCurveLoopIterator | Returns a curve that iterates through the curve loop. |
| Public method | GetEnumerator | Returns an enumerator that iterates through a collection. |
| Public method | GetExactLength | Returns the sum of exact lengths of all curves in the loop. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetPlane | Gets the plane of the curve loop, if it is planar. |
| Public method | GetRectangularHeight | Returns the width of a curve loop if it is rectangular with respect to the projection plane. |
| Public method | GetRectangularWidth | Returns the width of a curve loop if it is rectangular with respect to the projection plane. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | HasPlane | Identifies if the CurveLoop is planar. |
| Public method | IsCounterclockwise | Determines if this CurveLoop is oriented counter-clockwise (CCW) or clockwise (CW) with respect to the specified 3D direction. |
| Public method | IsOpen | Returns whether the curve loop is open or closed, as determined by an internal flag. |
| Public method | IsRectangular | Identifies if the curve loop is rectangular with respect to a given projection plane. |
| Public method | NumberOfCurves | Returns the number of curves in the curve loop. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |
| Public method | Transform | Transforms this curve loop and all of its component curves by the supplied transformation. |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

CurveLoop Class

Autodesk.Revit.DB Namespace